Revit 2024 API
BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError Property
 The specified angles are not compatible with current layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutError { get; }
Visual Basic
Public Shared ReadOnly Property SpecifiedAnglesNotCompatibleWithLayoutError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpecifiedAnglesNotCompatibleWithLayoutError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace